app/controllers/comments_controller.rb

SELECT * FROM `comments`
---
  def index
    @comments = Comment.all

SELECT * FROM `comments` WHERE (`comments`.`id` = 22)
---
  def show
    @comment = Comment.find(params[:id])

INSERT INTO `comments` (`updated_at`, `creation_time`, `post_id`, `content`, `user_id`, `created_at`) VALUES('2010-07-22 14:58:13', '2010-07-22 14:58:00', 0, 'tyuytuyt', 0, '2010-07-22 14:58:13')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save