app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`topic_id`, `updated_at`, `title`, `creation_time`, `content`, `user_id`, `created_at`) VALUES(22, '2010-07-23 11:27:30', 'Asssa', '2010-07-23 11:27:22', 'sssscdcdcdc', 5, '2010-07-23 11:27:30')