app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT * FROM `topics`

  def show
    @topic = Topic.find(params[:id])
---
SELECT * FROM `topics` WHERE (`topics`.`id` = 16)

  def create
    @topic = Topic.new(params[:topic])

    respond_to do |format|
      if @topic.save
---
INSERT INTO `topics` (`name`, `updated_at`, `creation_time`, `last_post`, `user_id`, `created_at`) VALUES('Created Topic', '2010-07-23 10:14:29', '2010-07-23 10:14:12', NULL, 5, '2010-07-23 10:14:29')